#### WaterChillerType Enumeration

---

|  |
| --- |
| See Also |

The type of water chiller.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum WaterChillerType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WaterChillerType ``` |

| Visual C++ |
| --- |
| ``` public enum class WaterChillerType ``` |

# Members

| Member name | Description |
| --- | --- |
| AirCooled |  |
| WaterCooled |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace